import { Student } from '../types';

export const rawStudentData: [number, number, string][] = [
  [1, 1, "CHE YUNHAO(차윤호)"], [1, 2, "XU YUNYA(허윤아)"], [1, 3, "김민서"], [1, 4, "김민아"], [1, 5, "김민채"], [1, 6, "김서우"], [1, 7, "김주아"], [1, 8, "김준헌"], [1, 9, "김지효"], [1, 10, "김태현"], [1, 11, "김현식"], [1, 12, "박소윤"], [1, 13, "박소형"], [1, 14, "백세현"], [1, 15, "설주원"], [1, 16, "손지안"], [1, 17, "윤지완"], [1, 18, "윤지후"], [1, 19, "이나래"], [1, 20, "이다온"], [1, 21, "이지민"], [1, 22, "이지안"], [1, 23, "이찬"], [1, 24, "이태완"], [1, 25, "장혜원"], [1, 26, "전소민"], [1, 27, "조승비"], [1, 28, "조영우"], [1, 29, "최은설"], [1, 30, "최은효"], [1, 31, "한유림"],
  [2, 1, "강유건"], [2, 2, "김도은"], [2, 3, "김서율"], [2, 4, "김승우"], [2, 5, "김예빈"], [2, 6, "김지훈"], [2, 7, "민서진"], [2, 8, "박도현"], [2, 9, "박지율"], [2, 10, "배승기"], [2, 11, "변재희"], [2, 12, "변선우"], [2, 13, "송상현"], [2, 14, "신지아"], [2, 15, "신지윤"], [2, 16, "원현종"], [2, 17, "윤채빈"], [2, 18, "이라임"], [2, 19, "이병현"], [2, 20, "이예지"], [2, 21, "이은엽"], [2, 22, "이채원"], [2, 23, "이하진"], [2, 24, "장재인"], [2, 25, "정민혁"], [2, 26, "정유주"], [2, 27, "조창"], [2, 28, "지효정"], [2, 29, "차혜성"], [2, 30, "함예진"], [2, 31, "홍예준"],
  [3, 1, "강태윤"], [3, 2, "고나은"], [3, 3, "구서현"], [3, 4, "권우빈"], [3, 5, "김나은"], [3, 6, "김수아"], [3, 7, "김시완"], [3, 8, "김시은"], [3, 10, "노하연"], [3, 11, "박서진"], [3, 12, "박하민"], [3, 13, "박하성"], [3, 14, "배서영"], [3, 15, "신준영"], [3, 16, "심하윤"], [3, 17, "예선우"], [3, 18, "유다원"], [3, 19, "이서연"], [3, 20, "이수아"], [3, 21, "이연우"], [3, 22, "이윤재"], [3, 23, "임다율"], [3, 24, "임예진"], [3, 25, "장서진"], [3, 26, "전도원"], [3, 27, "조민서"], [3, 28, "조하은"], [3, 29, "최효준"], [3, 30, "허태준"], [3, 31, "현유진"], [3, 32, "LI ZHIYUN(이지윤)"],
  [4, 1, "YIN JINGYUN(윤정운)"], [4, 2, "강서연"], [4, 3, "김도빈"], [4, 4, "김로운"], [4, 5, "김리아"], [4, 6, "김서연"], [4, 7, "김연아"], [4, 8, "김은재"], [4, 9, "김지은"], [4, 10, "김진휘"], [4, 11, "민정현"], [4, 12, "박기주"], [4, 13, "박유빈"], [4, 14, "배준석"], [4, 15, "서애리"], [4, 16, "손민준"], [4, 17, "신유림"], [4, 18, "유용구"], [4, 19, "윤채원"], [4, 20, "이다은"], [4, 21, "이민건"], [4, 22, "이주아"], [4, 23, "이주원"], [4, 24, "이채연"], [4, 26, "장채아"], [4, 27, "정민후"], [4, 28, "정예지"], [4, 29, "주경모"], [4, 30, "최서은"], [4, 31, "황시우"],
  [5, 1, "LIZHENGSHU(이정서)"], [5, 2, "강민주"], [5, 3, "김로한"], [5, 4, "김민"], [5, 5, "김사랑"], [5, 6, "김성재"], [5, 7, "김승헌"], [5, 9, "김주아"], [5, 10, "김태인"], [5, 11, "나하나"], [5, 12, "문종후"], [5, 13, "박나윤"], [5, 14, "박예나"], [5, 15, "백강호"], [5, 16, "손민규"], [5, 17, "신예빈"], [5, 18, "유주원"], [5, 19, "윤하람"], [5, 20, "이가람"], [5, 21, "이다윤"], [5, 22, "이주원"], [5, 23, "이주은"], [5, 24, "이채아"], [5, 25, "이태주"], [5, 26, "장하은"], [5, 27, "정아인"], [5, 28, "정하준"], [5, 29, "최송현"], [5, 30, "한소윤"], [5, 31, "한여원"],
  [6, 1, "강지환"], [6, 2, "공현지"], [6, 3, "김건후"], [6, 4, "김나희"], [6, 5, "김서은"], [6, 6, "김승현"], [6, 7, "김연서"], [6, 8, "김주원"], [6, 9, "김하희"], [6, 10, "노하은"], [6, 11, "박범준"], [6, 12, "박채원"], [6, 13, "박하엘"], [6, 14, "백서은"], [6, 15, "신주완"], [6, 16, "신채희"], [6, 17, "오재원"], [6, 18, "유미나"], [6, 19, "이민경"], [6, 20, "이수안"], [6, 21, "이시우"], [6, 22, "이윤재"], [6, 23, "이현재"], [6, 24, "이혜율"], [6, 25, "임채율"], [6, 26, "전준영"], [6, 27, "정하율"], [6, 28, "조혜인"], [6, 30, "현예영"], [6, 31, "홍동진"],
  [7, 1, "강윤제"], [7, 2, "공나윤"], [7, 3, "김경민"], [7, 4, "김다율"], [7, 5, "김서은"], [7, 6, "김슬우"], [7, 7, "김주아"], [7, 8, "김지윤"], [7, 9, "김채민"], [7, 10, "문서연"], [7, 11, "박민서"], [7, 12, "박채빈"], [7, 13, "방정우"], [7, 14, "서지애"], [7, 15, "서지우"], [7, 16, "신서율"], [7, 17, "우선우"], [7, 18, "윤예은"], [7, 19, "이로하"], [7, 20, "이상우"], [7, 21, "이예서"], [7, 22, "이윤호"], [7, 23, "이하랑"], [7, 24, "이현우"], [7, 25, "장윤지"], [7, 26, "정대윤"], [7, 27, "정채린"], [7, 28, "주지현"], [7, 29, "최연우"], [7, 30, "허아영"], [7, 31, "홍서빈"],
  [8, 1, "계은빈"], [8, 2, "권범준"], [8, 3, "권아윤"], [8, 4, "김규빈"], [8, 5, "김시아"], [8, 6, "김시연"], [8, 7, "김아인"], [8, 8, "노영서"], [8, 9, "노윤서"], [8, 10, "박이든"], [8, 11, "박준우"], [8, 12, "박하율"], [8, 13, "반서윤"], [8, 14, "신하윤"], [8, 15, "안수진"], [8, 16, "안제이"], [8, 17, "오서연"], [8, 18, "이소율"], [8, 19, "이수빈"], [8, 20, "이연우"], [8, 21, "이예담"], [8, 22, "임서린"], [8, 23, "임승연"], [8, 24, "장제윤"], [8, 25, "장태희"], [8, 26, "조윤진"], [8, 27, "조하율"], [8, 28, "한상욱"], [8, 29, "허찬욱"], [8, 30, "황수련"], [8, 31, "황하윤"]
];

export const students: Student[] = rawStudentData.map(data => {
  const c = data[0];
  const n = data[1];
  const sId = `1${String(c).padStart(2, '0')}${String(n).padStart(2, '0')}`;
  return { id: sId, grade: 1, classNum: c, num: n, name: data[2] };
});

export const categories: Record<string, string[]> = {
  "용모 복장": ["복장 위반", "장신구(귀걸이)", "색조 화장", "고성방가"],
  "수업": ["수업 장소 이탈", "휴대폰 및 태블릿 무단 사용", "수업 방해", "지시 불이행"],
  "학교 생활": ["쓰레기 투척", "바닥에 침 뱉기", "질서유지 위반", "위험 행동(난간)", "기타"]
};

export const ADMIN_USERS = ['안효은', '홍준선', '변예원', '양미영', '김선심'];
export const GOOGLE_APP_SCRIPT_URL = "https://script.google.com/macros/s/AKfycby8uk2QL-zNHoW36yimlb-hKRclHOUBGEr9CjRy9LbsRFxL8pFwrML4JXM42jkPAEx0/exec";
